In [112]:
# """
# numpy : 수치연산
# pandas : 데이터분석 
# """

In [143]:
import pandas as pd                                                                            #pandas 패키지(package) : 데이터분석 관련 함수 묶음

myFile=pd.read_csv('test.csv', index_col=0, nrows=3)
myFile

   LAST_NAME  AGE
ID
1        KIM   25
2        LEE   30
3       PARK   20

In [114]:
myFile.shape

(3, 2)

In [115]:
type(myFile)

pandas.core.frame.DataFrame

In [116]:
# pd.DataFrame()
#csv -> read_csv() -> dataframe

In [117]:
data={'id':['a1','a2'],'x1':[1,2],'x2':[3,4]}
type(data)

dict

In [118]:
k={1,2,3}
type(k)

set

In [119]:
df=pd.DataFrame(data, index=['I', 'You'])
type(df)
#csv -> read_csv() -> dataframe

pandas.core.frame.DataFrame

In [120]:
df

     id  x1  x2
I    a1   1   3
You  a2   2   4

In [121]:
df.to_csv("testsave.csv", index=False)

In [122]:
import numpy as np

In [123]:
np.arange(12).reshape(3,4)
# type(np.arange(12).reshape(3,4))

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [124]:
# type(pd.DataFrame(np.arange(12).reshape(3,4)))
df=pd.DataFrame(np.arange(12).reshape(3,4), columns=['a','b','c','d'], index=['x','y','z'])
df

   a  b   c   d
x  0  1   2   3
y  4  5   6   7
z  8  9  10  11

In [125]:
# 3*5 5*3 -> 이럴경우에만 행렬의 곱이 가능하다(앞의 열과 뒤의 행이 같아야 한다)
# (3,5)*(5*3) => (3,3)

In [126]:
# 벡터의 내적
# (2*2)*(2*3) => (2,3)
# (5*3)*(3*7) => (5,7)


# 1 2             1 2 3              5  8  11      
# 1 0             2 3 4     =>    1   2   3

In [127]:
#코사인유사도 기반 추천시스템
#cos(di,dj)=(di,dj)/(|di||dj|)

In [128]:
df
df.T
df.dtypes

a    int64
b    int64
c    int64
d    int64
dtype: object

In [129]:
df.size # 요소 개수
df.values # 값 추출

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [130]:
#코사인유사도 기반 추천시스템 작성하기
#나랑 가장 비슷한 1명/ 가장 다른 1명을 출력해보자

In [131]:
df2=pd.DataFrame({
            'cls' : ['a','a','b','b','c'],
            'v1':np.arange(5),
            'v2':np.random.randn(5)},
            index=['r0','r1','r2','r3','r4'])
df2

   cls  v1        v2
r0   a   0  1.545642
r1   a   1 -0.473841
r2   b   2 -1.055670
r3   b   3 -0.253430
r4   c   4  2.022479

In [132]:
np.random.randn()
#normal distribution : 표준정규분포
#randn : 평균0, 표준편차:1

1.8886243692683675

In [133]:
df2.index

Index(['r0', 'r1', 'r2', 'r3', 'r4'], dtype='object')

In [134]:
df2.iloc[:]
# lioc : 행 인덱스가 아닌 기본 인덱스가 있다고 전제(0번부터~)
# 하고 기본인덱스를 가지고 데이터 추출

   cls  v1        v2
r0   a   0  1.545642
r1   a   1 -0.473841
r2   b   2 -1.055670
r3   b   3 -0.253430
r4   c   4  2.022479

In [135]:
df2.loc['r2':]
# loc : 행 인덱스로 참조할때 사용

   cls  v1        v2
r2   b   2 -1.055670
r3   b   3 -0.253430
r4   c   4  2.022479

In [136]:
df2

   cls  v1        v2
r0   a   0  1.545642
r1   a   1 -0.473841
r2   b   2 -1.055670
r3   b   3 -0.253430
r4   c   4  2.022479

In [137]:
df2['cls']

r0    a
r1    a
r2    b
r3    b
r4    c
Name: cls, dtype: object

In [138]:
df2['v1']

r0    0
r1    1
r2    2
r3    3
r4    4
Name: v1, dtype: int64

In [139]:
df2[['v1','v2']]

    v1        v2
r0   0  1.545642
r1   1 -0.473841
r2   2 -1.055670
r3   3 -0.253430
r4   4  2.022479

In [140]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, r0 to r4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   cls     5 non-null      object
 1   v1      5 non-null      int64
 2   v2      5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 320.0+ bytes

In [141]:
df2

   cls  v1        v2
r0   a   0  1.545642
r1   a   1 -0.473841
r2   b   2 -1.055670
r3   b   3 -0.253430
r4   c   4  2.022479

In [142]:
df2.loc[:,['v1','v2']]

    v1        v2
r0   0  1.545642
r1   1 -0.473841
r2   2 -1.055670
r3   3 -0.253430
r4   4  2.022479